ErichStyger/mcuoneclipse/Examples/MCUXpresso/K22FX5120/K22FX512xxx12_FreeRTOS/CMSIS/MK22F12_features.h
/* @brief Has partial stop option (register bit STOPCTRL[PSTOPO]). */
#define FSL_FEATURE_SMC_HAS_PSTOPO (0)
/* @brief Has LPO power option (register bit STOPCTRL[LPOPO]). */
#define FSL_FEATURE_SMC_HAS_LPOPO (0)
/* @brief Has POR power option (register bit STOPCTRL[PORPO] or VLLSCTRL[PORPO]). */
#define FSL_FEATURE_SMC_HAS_PORPO (1)
/* @brief Has low power wakeup on interrupt (register bit PMCTRL[LPWUI]). */
#define FSL_FEATURE_SMC_HAS_LPWUI (1)
/* @brief Has LLS or VLLS mode control (register bit STOPCTRL[LLSM]). */
#define FSL_FEATURE_SMC_HAS_LLS_SUBMODE (0)
/* @brief Has VLLS mode control (register bit VLLSCTRL[VLLSM]). */
#define FSL_FEATURE_SMC_USE_VLLSCTRL_REG (1)
/* @brief Has VLLS mode control (register bit STOPCTRL[VLLSM]). */
#define FSL_FEATURE_SMC_USE_STOPCTRL_VLLSM (0)
/* @brief Has RAM partition 2 power option (register bit STOPCTRL[RAM2PO]). */
#define FSL_FEATURE_SMC_HAS_RAM2_POWER_OPTION (0)
/* @brief Has high speed run mode (register bit PMPROT[AHSRUN]). */
#define FSL_FEATURE_SMC_HAS_HIGH_SPEED_RUN_MODE (0)
/* @brief Has low leakage stop mode (register bit PMPROT[ALLS]). */
#define FSL_FEATURE_SMC_HAS_LOW_LEAKAGE_STOP_MODE (1)
/* @brief Has very low leakage stop mode (register bit PMPROT[AVLLS]). */
#define FSL_FEATURE_SMC_HAS_VERY_LOW_LEAKAGE_STOP_MODE (1)
/* @brief Has stop submode. */
#define FSL_FEATURE_SMC_HAS_SUB_STOP_MODE (1)
/* @brief Has stop submode 0(VLLS0). */
#define FSL_FEATURE_SMC_HAS_STOP_SUBMODE0 (1)
/* @brief Has stop submode 1(VLLS1). */
#define FSL_FEATURE_SMC_HAS_STOP_SUBMODE1 (1)
/* @brief Has stop submode 2(VLLS2). */
#define FSL_FEATURE_SMC_HAS_STOP_SUBMODE2 (1)
/* @brief Has SMC_PARAM. */
#define FSL_FEATURE_SMC_HAS_PARAM (0)
/* @brief Has SMC_VERID. */
#define FSL_FEATURE_SMC_HAS_VERID (0)
/* @brief Has stop abort flag (register bit PMCTRL[STOPA]). */
#define FSL_FEATURE_SMC_HAS_PMCTRL_STOPA (1)
/* @brief Has tamper reset (register bit SRS[TAMPER]). */
#define FSL_FEATURE_SMC_HAS_SRS_TAMPER (0)
/* @brief Has security violation reset (register bit SRS[SECVIO]). */
#define FSL_FEATURE_SMC_HAS_SRS_SECVIO (0)

/* DSPI module features */

#if defined(CPU_MK22FN1M0VLH12) || defined(CPU_MK22FX512VLH12)
    /* @brief Receive/transmit FIFO size in number of items. */
    #define FSL_FEATURE_DSPI_FIFO_SIZEn(x) (4)
    /* @brief Maximum transfer data width in bits. */
    #define FSL_FEATURE_DSPI_MAX_DATA_WIDTH (16)
    /* @brief Maximum number of chip select pins. (Reflects the width of register bit field PUSHR[PCS].) */
    #define FSL_FEATURE_DSPI_MAX_CHIP_SELECT_COUNT (6)
    /* @brief Number of chip select pins. */
    #define FSL_FEATURE_DSPI_CHIP_SELECT_COUNT (5)
    /* @brief Has chip select strobe capability on the PCS5 pin. */
    #define FSL_FEATURE_DSPI_HAS_CHIP_SELECT_STROBE (1)
    /* @brief Has separated TXDATA and CMD FIFOs (register SREX). */
    #define FSL_FEATURE_DSPI_HAS_SEPARATE_TXDATA_CMD_FIFO (0)
    /* @brief Has 16-bit data transfer support. */
    #define FSL_FEATURE_DSPI_16BIT_TRANSFERS (1)
    /* @brief Has separate DMA RX and TX requests. */
    #define FSL_FEATURE_DSPI_HAS_SEPARATE_DMA_RX_TX_REQn(x) (1)
#elif defined(CPU_MK22FN1M0VLK12) || defined(CPU_MK22FX512VLK12)
    /* @brief Receive/transmit FIFO size in number of items. */
    #define FSL_FEATURE_DSPI_FIFO_SIZEn(x) \
        ((x) == SPI0 ? (4) : \
        ((x) == SPI1 ? (1) : (-1)))
    /* @brief Maximum transfer data width in bits. */
    #define FSL_FEATURE_DSPI_MAX_DATA_WIDTH (16)
    /* @brief Maximum number of chip select pins. (Reflects the width of register bit field PUSHR[PCS].) */
    #define FSL_FEATURE_DSPI_MAX_CHIP_SELECT_COUNT (6)
    /* @brief Number of chip select pins. */
    #define FSL_FEATURE_DSPI_CHIP_SELECT_COUNT (5)
    /* @brief Has chip select strobe capability on the PCS5 pin. */
    #define FSL_FEATURE_DSPI_HAS_CHIP_SELECT_STROBE (1)
    /* @brief Has separated TXDATA and CMD FIFOs (register SREX). */
    #define FSL_FEATURE_DSPI_HAS_SEPARATE_TXDATA_CMD_FIFO (0)
    /* @brief Has 16-bit data transfer support. */
    #define FSL_FEATURE_DSPI_16BIT_TRANSFERS (1)
    /* @brief Has separate DMA RX and TX requests. */
    #define FSL_FEATURE_DSPI_HAS_SEPARATE_DMA_RX_TX_REQn(x) \
        ((x) == SPI0 ? (1) : \
        ((x) == SPI1 ? (0) : (-1)))
#elif defined(CPU_MK22FN1M0VLL12) || defined(CPU_MK22FN1M0VLQ12) || defined(CPU_MK22FN1M0VMC12) || defined(CPU_MK22FN1M0VMD12) || \
    defined(CPU_MK22FX512VLL12) || defined(CPU_MK22FX512VLQ12) || defined(CPU_MK22FX512VMC12) || defined(CPU_MK22FX512VMD12)
    /* @brief Receive/transmit FIFO size in number of items. */
    #define FSL_FEATURE_DSPI_FIFO_SIZEn(x) \
        ((x) == SPI0 ? (4) : \
        ((x) == SPI1 ? (1) : \
        ((x) == SPI2 ? (1) : (-1))))
    /* @brief Maximum transfer data width in bits. */
    #define FSL_FEATURE_DSPI_MAX_DATA_WIDTH (16)
    /* @brief Maximum number of chip select pins. (Reflects the width of register bit field PUSHR[PCS].) */
    #define FSL_FEATURE_DSPI_MAX_CHIP_SELECT_COUNT (6)
    /* @brief Number of chip select pins. */
    #define FSL_FEATURE_DSPI_CHIP_SELECT_COUNT (6)
    /* @brief Has chip select strobe capability on the PCS5 pin. */
    #define FSL_FEATURE_DSPI_HAS_CHIP_SELECT_STROBE (1)
    /* @brief Has separated TXDATA and CMD FIFOs (register SREX). */
    #define FSL_FEATURE_DSPI_HAS_SEPARATE_TXDATA_CMD_FIFO (0)
    /* @brief Has 16-bit data transfer support. */
    #define FSL_FEATURE_DSPI_16BIT_TRANSFERS (1)
    /* @brief Has separate DMA RX and TX requests. */
    #define FSL_FEATURE_DSPI_HAS_SEPARATE_DMA_RX_TX_REQn(x) \
        ((x) == SPI0 ? (1) : \
        ((x) == SPI1 ? (0) : \
        ((x) == SPI2 ? (0) : (-1))))
#endif /* defined(CPU_MK22FN1M0VLH12) || defined(CPU_MK22FX512VLH12) */

/* SYSMPU module features */

#if defined(CPU_MK22FN1M0VLH12) || defined(CPU_MK22FX512VLH12)
    /* @brief Specifies number of descriptors available. */
    #define FSL_FEATURE_SYSMPU_DESCRIPTOR_COUNT (12)
    /* @brief Has process identifier support. */
    #define FSL_FEATURE_SYSMPU_HAS_PROCESS_IDENTIFIER (1)
    /* @brief Total number of MPU slave. */
    #define FSL_FEATURE_SYSMPU_SLAVE_COUNT (5)
    /* @brief Total number of MPU master. */
    #define FSL_FEATURE_SYSMPU_MASTER_COUNT (5)
#elif defined(CPU_MK22FN1M0VLK12) || defined(CPU_MK22FN1M0VLL12) || defined(CPU_MK22FN1M0VLQ12) || defined(CPU_MK22FN1M0VMC12) || \
    defined(CPU_MK22FN1M0VMD12) || defined(CPU_MK22FX512VLK12) || defined(CPU_MK22FX512VLL12) || defined(CPU_MK22FX512VLQ12) || \
    defined(CPU_MK22FX512VMC12) || defined(CPU_MK22FX512VMD12)
    /* @brief Specifies number of descriptors available. */
    #define FSL_FEATURE_SYSMPU_DESCRIPTOR_COUNT (12)
    /* @brief Has process identifier support. */
    #define FSL_FEATURE_SYSMPU_HAS_PROCESS_IDENTIFIER (1)
    /* @brief Total number of MPU slave. */
    #define FSL_FEATURE_SYSMPU_SLAVE_COUNT (5)
    /* @brief Total number of MPU master. */
    #define FSL_FEATURE_SYSMPU_MASTER_COUNT (6)
#endif /* defined(CPU_MK22FN1M0VLH12) || defined(CPU_MK22FX512VLH12) */

/* SysTick module features */

/* @brief Systick has external reference clock. */
#define FSL_FEATURE_SYSTICK_HAS_EXT_REF (0)
/* @brief Systick external reference clock is core clock divided by this value. */
#define FSL_FEATURE_SYSTICK_EXT_REF_CORE_DIV (0)

/* UART module features */

